nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MIMXRT1172/fsl_pm_device.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_pm_core.h"
#include "fsl_pm_device.h"

#include "fsl_pmu.h"
#include "fsl_pgmc.h"
#include "fsl_gpc.h"
#include "fsl_ssarc.h"
#include "fsl_dcdc.h"
#include "fsl_clock.h"
#include "fsl_soc_src.h"

/*******************************************************************************
 * Macros
 ******************************************************************************/

#define NA   31U
#define SP0  0U
#define SP1  1U
#define SP2  2U
#define SP3  3U
#define SP4  4U
#define SP5  5U
#define SP6  6U
#define SP7  7U
#define SP8  8U
#define SP9  9U
#define SP10 10U
#define SP11 11U
#define SP12 12U
#define SP13 13U
#define SP14 14U
#define SP15 15U

#if __CORTEX_M == 7
#define CURRENT_GPC_INSTANCE   GPC_CPU_MODE_CTRL_0
#define CURRENT_STBY_CORE_NAME kGPC_CM4Core

/*! @brief
 * Definition of power domains' setpoint map.
 */
#define PM_RT1170_MEGAMIX_SETPOINT_MAP    (0xF800U) // MEGAMIX will be powered off from setpoint 11 to setpoint 15.
#define PM_RT1170_DISPLAYMIX_SETPOINT_MAP (0xF800U) // DISPLAYMIX will be powered off from setpoint 11 to setpoint 15.
#define PM_RT1170_WAKEUPMIX_SETPOINT_MAP  (0xF800U) // MEGAMIX will be powered off from setpoint 11 to setpoint 15.
#define PM_RT1170_LPSRMIX_SETPOINT_MAP    (0x0000U) // LPSRMIX powered on for all setpoint.

/*!
 * @brief Definition of DCDC's setpoint map.
 */
#define PM_RT1170_DCDC_ENABLE_SETPOINT_MAP     (0x7FFU)    // DCDC will be powered off from setpoint 11 to setpoint 15.
#define PM_RT1170_DCDC_DIG_ENABLE_SETPOINT_MAP (0x7FFU)    // DCDC_DIG will be powered off from setpoint 11 to
                                                           // setpoint 15.
#define PM_RT1170_DCDC_LP_MODE_SETPOINT_MAP (0x0U)         // DCDC_LP_MODE will be disabled from all setpoint.
#define PM_RT1170_DCDC_STANDBY_SETPOINT_MAP (0x7FFU)       // DCDC standby mode will be disabled from setpoint 11 to
                                                           // setpoint 15.
#define PM_RT1170_DCDC_LP_MODE_STANDBY_SETPOINT_MAP (0x0U) // Disable standby request from GPC to enter LP mode
                                                           // for all setpoints.S

/*!
 * @brief Definition of bandgap's setpoint map.
 *
 */
#define PM_RT1170_BANDGAP_EN_SETPOINT_MAP      (0xFFFFU) // Bandgap is enabled for all setpoints.
#define PM_RT1170_BANDGAP_STANDBY_SETPOINT_MAP (0xFFFFU) // Bandgap standby mode is disabled for all setpoints.

/*!
 * @brief Definition of FBB's setpoint map.
 */
#define PM_RT1170_FBB_EN_SETPOINT_MAP      (0xEU)    // FBB is enabled from setpoint 1 to setpoint 3.
#define PM_RT1170_FBB_STANDBY_SETPOINT_MAP (0xFFFFU) // FBB standby mode is disabled for all setpoints.

/*!
 * @brief Definition of RBBs' setpoint map.
 */
#define PM_RT1170_RBB_SOC_EN_SETPOINT_MAP      (0x500U)  // RBB_SOC is enabled for setpoint 8 and setpoint 10.
#define PM_RT1170_RBB_SOC_STANDBY_SETPOINT_MAP (0xFFFFU) // RBB_SOC standby mode is disabled for all setpoints.
#define PM_RT1170_RBB_LPSR_EN_SETPOINT_MAP \
    (0x8500U) // RBB_LPSR is enabled for setpoint 8, setpoint10 and setpoint 15, ToDo.
#define PM_RT1170_RBB_LPSR_STANDBY_SETPOINT_MAP (0xFFFFU) // RBB_LPSR standby mode is disabled for all setpoints.

/*!
 * @brief Definition of LDOs' setpoint map.
 */
#define PM_RT1170_PLL_LDO_EN_SETPOINT_MAP      (0x7FU)   // PLL_LDO is enabled from setpoint 0 to setpoint 6.
#define PM_RT1170_PLL_LDO_STANDBY_SETPOINT_MAP (0xFFFFU) // PLL_LDO standby mode is disabled for all setpoints.
#define PM_RT1170_LPSR_ANA_LDO_EN_SETPOINT_MAP (0xF800U) // LPSR_ANA_DO is enabled from setpoint 11 to setpoint 15.
#define PM_RT1170_LPSR_ANA_LDO_STANDBY_SETPOINT_MAP \
    (0xFFFFU) // LPSR_ANA_LDO standby mode is disabled for all setpoints.
#define PM_RT1170_LPSR_ANA_LDO_LP_MODE_SETPOINT_MAP \
    (0xFFFFU) // LPSR_ANA_LDO lowpower mode is disabled for all setpoints.
#define PM_RT1170_LPSR_ANA_LDO_TRACKING_EN_SETPOINT_MAP \
    (~PM_RT1170_LPSR_ANA_LDO_EN_SETPOINT_MAP) // LPSR_ANA_DO tracking is enabled
                                              // from setpoint 0 to setpoint 10.
#define PM_RT1170_LPSR_ANA_LDO_BYPASS_EN_SETPOINT_MAP \
    (~PM_RT1170_LPSR_ANA_LDO_EN_SETPOINT_MAP)                 // LPSR_ANA_DO bypass is enabled from
                                                              // setpoint 0 to setpoint 10.
#define PM_RT1170_LPSR_DIG_LDO_EN_SETPOINT_MAP (0xF81C)       // LPSR_DIG_DO is enabled from setpoint 2 to setpoint 4,
                                                              // and setpoint 11 to setpoint 15.
#define PM_RT1170_LPSR_DIG_LDO_STANDBY_SETPOINT_MAP (0xFFFFU) // LPSR_DIG_DO standby mode is disabled for all setpoints.
#define PM_RT1170_LPSR_DIG_LDO_LP_MODE_SETPOINT_MAP \
    (0xFFFFU) // LPSR_DIG_DO lowpower mode is disabled for all setpoints.
#define PM_RT1170_LPSR_DIG_LDO_TRACKING_EN_SETPOINT_MAP \
    (~PM_RT1170_LPSR_DIG_LDO_EN_SETPOINT_MAP) // LPSR_DIG_DO tracking is enabled
                                              // from setpoint 0 to setpoint 1,
                                              // and setpoint 5 to setpoint 10.
#define PM_RT1170_LPSR_DIG_LDO_BYPASS_EN_SETPOINT_MAP \
    (~PM_RT1170_LPSR_DIG_LDO_EN_SETPOINT_MAP) // LPSR_DIG_DO bypass is enabled from
                                              // setpoint 0 to setpoint 1,
                                              // and setpoint 5 to setpoint 10.

/* clang-format off */
#define PM_RT1170_CM7_COMPATIBLE_SETPOINT_MAP                           \
{{NA , SP1, SP2, SP3, SP0, SP4, SP5, SP6, SP7, SP8, SP9, SP10, SP11, SP12, SP13, SP14, SP15}, \
{SP1 ,   1,   0,   0,   0,   0,   0,   0,   0,   0,   0,    0,    0,    0,    0,    0,    0}, \
{SP2 ,   1,   1,   0,   0,   0,   0,   0,   0,   0,   0,    0,    0,    0,    0,    0,    0}, \
{SP3 ,   1,   1,   1,   0,   0,   0,   0,   0,   0,   0,    0,    0,    0,    0,    0,    0}, \
{SP0 ,   1,   1,   1,   1,   0,   0,   0,   0,   0,   0,    0,    0,    0,    0,    0,    0}, \
{SP4 ,   1,   1,   1,   1,   1,   0,   0,   0,   0,   0,    0,    0,    0,    0,    0,    0}, \
{SP5 ,   1,   1,   1,   1,   1,   1,   0,   0,   0,   0,    0,    0,    0,    0,    0,    0}, \
{SP6 ,   1,   1,   1,   1,   1,   1,   1,   0,   0,   0,    0,    0,    0,    0,    0,    0}, \
{SP7 ,   1,   1,   1,   1,   1,   1,   1,   1,   0,   0,    0,    0,    0,    0,    0,    0}, \
{SP8 ,   1,   1,   1,   1,   1,   1,   1,   1,   1,   0,    0,    0,    0,    0,    0,    0}, \
{SP9 ,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    0,    0,    0,    0,    0,    0}, \
{SP10,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    1,    0,    0,    0,    0,    0}, \
{SP11,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    1,    1,    1,    1,    1,    1}, \
{SP12,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    1,    1,    1,    1,    1,    1}, \
{SP13,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    1,    1,    1,    1,    1,    1}, \
{SP14,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    1,    1,    1,    1,    1,    1}, \
{SP15,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,    1,    1,    1,    1,    1,    1}}
/* clang-format on */

