nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MIMXRT1172/fsl_pm_device.c
/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief Find operate mode to set.
 */
static inline uint8_t RT1170_FindOperateMode(uint32_t rescIndex, pm_resc_group_t *pSysRescGroup)
{
    uint8_t u8Tmp = (pSysRescGroup->groupSlice[rescIndex / 8UL] >> (4UL * (rescIndex % 8UL))) & 0xFUL;

    // Find first set, that is the operate mode to set.
    u8Tmp |= (u8Tmp >> 1U);
    u8Tmp |= (u8Tmp >> 2U);

    return ((u8Tmp + 1U) >> 1U);
}

#if __CORTEX_M == 7
/*!
 * @brief Configure setpoint mapping for CM7.
 */
static inline void RT1170_SetCore0PlatformSetpointMap(GPC_CPU_MODE_CTRL_Type *base)
{
    uint8_t i, j;
    uint32_t u32Tmp;

    uint8_t coreSetpointMap[17U][17U] = PM_RT1170_CM7_COMPATIBLE_SETPOINT_MAP;

    // Enable CPU sleep hold.
    GPC_CM_EnableCpuSleepHold(base, true);

    for (i = 1U; i < 17U; i++)
    {
        u32Tmp = 0UL;
        for (j = 1U; j < 17U; j++)
        {
            u32Tmp |= coreSetpointMap[i][j] << coreSetpointMap[0U][j];
        }
        GPC_CM_SetSetPointMapping(base, coreSetpointMap[i][0U], u32Tmp);
    }
}

/*!
 * @brief Set clock source controlled by setpoint, CM7 is responsible for set this.
 */
static inline void RT1170_SetClockSourcesControlBySetpoint(void)
{
    // 1. Clock sources implement setpoint control scheme.
    // Set OSC_PLL's control mode as software mode.
    ANADIG_OSC->OSC_16M_CTRL &= ~ANADIG_OSC_OSC_16M_CTRL_RC_16M_CONTROL_MODE_MASK;
    ANADIG_OSC->OSC_48M_CTRL &=
        ~(ANADIG_OSC_OSC_48M_CTRL_RC_48M_CONTROL_MODE_MASK | ANADIG_OSC_OSC_48M_CTRL_RC_48M_DIV2_CONTROL_MODE_MASK);
    ANADIG_OSC->OSC_24M_CTRL &= ~ANADIG_OSC_OSC_24M_CTRL_OSC_24M_CONTROL_MODE_MASK;
    ANADIG_OSC->OSC_400M_CTRL1 &= ~ANADIG_OSC_OSC_400M_CTRL1_RC_400M_CONTROL_MODE_MASK;
    ANADIG_PLL->ARM_PLL_CTRL &= ~ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_CONTROL_MODE_MASK;
    ANADIG_PLL->SYS_PLL1_CTRL &= ~(ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_CONTROL_MODE_MASK |
                                   ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV2_CONTROL_MODE_MASK |
                                   ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV5_CONTROL_MODE_MASK);
    ANADIG_PLL->SYS_PLL3_CTRL &= ~(ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_CONTROL_MODE_MASK |
                                   ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_DIV2_CONTROL_MODE_MASK);
    ANADIG_PLL->SYS_PLL3_UPDATE &=
        ~(ANADIG_PLL_SYS_PLL3_UPDATE_PFD0_CONTROL_MODE_MASK | ANADIG_PLL_SYS_PLL3_UPDATE_PFD1_CONTROL_MODE_MASK |
          ANADIG_PLL_SYS_PLL3_UPDATE_PDF2_CONTROL_MODE_MASK | ANADIG_PLL_SYS_PLL3_UPDATE_PFD3_CONTROL_MODE_MASK);
    ANADIG_PLL->SYS_PLL2_CTRL &= ~ANADIG_PLL_SYS_PLL2_CTRL_SYS_PLL2_CONTROL_MODE_MASK;
    ANADIG_PLL->SYS_PLL2_UPDATE &=
        ~(ANADIG_PLL_SYS_PLL2_UPDATE_PFD0_CONTROL_MODE_MASK | ANADIG_PLL_SYS_PLL2_UPDATE_PFD1_CONTROL_MODE_MASK |
          ANADIG_PLL_SYS_PLL2_UPDATE_PFD2_CONTROL_MODE_MASK | ANADIG_PLL_SYS_PLL2_UPDATE_PFD3_CONTROL_MODE_MASK);
    ANADIG_PLL->PLL_AUDIO_CTRL &= ~ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_CONTROL_MODE_MASK;
    ANADIG_PLL->PLL_VIDEO_CTRL &= ~ANADIG_PLL_PLL_VIDEO_CTRL_PLL_VIDEO_CONTROL_MODE_MASK;

    clock_name_t clockSourceName = kCLOCK_OscRc16M;
    for (clockSourceName = kCLOCK_OscRc16M; clockSourceName <= kCLOCK_VideoPllOut; clockSourceName++)
    {
        if (!CLOCK_OSCPLL_IsSetPointImplemented((clock_name_t)clockSourceName))
        {
            assert(0);
        }
        // keep clock source init state aligned with set point 0 state.
        if ((g_clockSourceSpMapping[(uint8_t)clockSourceName] & 0x1) == 0)
        {
            CCM->OSCPLL[(uint8_t)clockSourceName].DIRECT = 0;
        }
        else
        {
            CCM->OSCPLL[(uint8_t)clockSourceName].DIRECT = 1;
        }
        // All clock sources except OSC_RC 16M are turned off in standby mode.
        uint32_t standbyValue = 0UL;
        if (clockSourceName == kCLOCK_OscRc16M)
        {
            standbyValue = 0xFFFFU;
        }
        CLOCK_OSCPLL_ControlBySetPointMode(clockSourceName, g_clockSourceSpMapping[(uint8_t)clockSourceName],
                                           standbyValue);
    }

    //  2. Set clock sources work as hardware control mode.
    CLOCK_OSC_SetOsc16MControlMode(kCLOCK_GpcMode);
    CLOCK_OSC_SetOsc48MControlMode(kCLOCK_GpcMode);
    CLOCK_OSC_SetOsc48MDiv2ControlMode(kCLOCK_GpcMode);
    CLOCK_OSC_SetOsc24MControlMode(kCLOCK_GpcMode);
    CLOCK_OSC_SetOscRc400MControlMode(kCLOCK_GpcMode);
    ANADIG_PLL->ARM_PLL_CTRL |= ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_CONTROL_MODE_MASK;
    ANADIG_PLL->SYS_PLL1_CTRL |= (ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_CONTROL_MODE_MASK |
                                  ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV2_CONTROL_MODE_MASK |
                                  ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV5_CONTROL_MODE_MASK);
    ANADIG_PLL->SYS_PLL3_CTRL |= (ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_CONTROL_MODE_MASK |
                                  ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_DIV2_CONTROL_MODE_MASK);
    ANADIG_PLL->SYS_PLL3_UPDATE |=
        (ANADIG_PLL_SYS_PLL3_UPDATE_PFD0_CONTROL_MODE_MASK | ANADIG_PLL_SYS_PLL3_UPDATE_PFD1_CONTROL_MODE_MASK |
         ANADIG_PLL_SYS_PLL3_UPDATE_PDF2_CONTROL_MODE_MASK | ANADIG_PLL_SYS_PLL3_UPDATE_PFD3_CONTROL_MODE_MASK);
    ANADIG_PLL->SYS_PLL2_CTRL |= ANADIG_PLL_SYS_PLL2_CTRL_SYS_PLL2_CONTROL_MODE_MASK;
    ANADIG_PLL->SYS_PLL2_UPDATE |=
        (ANADIG_PLL_SYS_PLL2_UPDATE_PFD0_CONTROL_MODE_MASK | ANADIG_PLL_SYS_PLL2_UPDATE_PFD1_CONTROL_MODE_MASK |
         ANADIG_PLL_SYS_PLL2_UPDATE_PFD2_CONTROL_MODE_MASK | ANADIG_PLL_SYS_PLL2_UPDATE_PFD3_CONTROL_MODE_MASK);
    ANADIG_PLL->PLL_AUDIO_CTRL |= ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_CONTROL_MODE_MASK;
    ANADIG_PLL->PLL_VIDEO_CTRL |= ANADIG_PLL_PLL_VIDEO_CTRL_PLL_VIDEO_CONTROL_MODE_MASK;
}

/*!
 * @brief Set power domains controlled by setpoint, including MEGAMIX, DISPLAYMIX, and WANEMIX, CM7 is responsible for
 * set this
 */
static inline void RT1170_SetPowerDomainsControlBySetpoint(void)
{
    pgmc_bpc_setpoint_mode_option_t bpcSetpointOption = {
        .stateSave = false,
        .powerOff  = true,
    };
    //    a. MEGAMIX settings.
    PGMC_BPC_ControlPowerDomainBySetPointMode(PGMC_BPC0, PM_RT1170_MEGAMIX_SETPOINT_MAP, &bpcSetpointOption);
    //    b. DISPLAYMIX settings.
    PGMC_BPC_ControlPowerDomainBySetPointMode(PGMC_BPC1, PM_RT1170_DISPLAYMIX_SETPOINT_MAP, &bpcSetpointOption);
    //    c. WANEMIX settings.
    PGMC_BPC_ControlPowerDomainBySetPointMode(PGMC_BPC2, PM_RT1170_WAKEUPMIX_SETPOINT_MAP, &bpcSetpointOption);
    //    d. LPSRMIX settings.
    PGMC_BPC_ControlPowerDomainBySetPointMode(PGMC_BPC3, PM_RT1170_LPSRMIX_SETPOINT_MAP, &bpcSetpointOption);

    pgmc_bpc_cpu_power_mode_option_t bpcCpuModeOption = {
        .stateSave    = false,
        .assignDomain = kPGMC_CM7Core,
        .powerOff     = true,
    };

    // Maybe need to controlled by user?
    PGMC_BPC_ControlPowerDomainByCpuPowerMode(PGMC_BPC4, kPGMC_SuspendMode, &bpcCpuModeOption);
}

/*!
 * @brief Set power supply controlled by setpoint, including DCDC and internal LPSR LDOs, CM7 is responsible
 * for set this.
 */
static inline void RT1170_SetPowerSupplyControlBySetpoint(void)
{
    //    a. Set DCDC controlled by setpoint.
    DCDC_SetPointInit(DCDC, &g_dcdcSpConfig);
    if ((DCDC->CTRL0 & DCDC_CTRL0_CONTROL_MODE_MASK) == 0UL)
    {
        // Change to setpoint control mode.
        DCDC->CTRL0 |= DCDC_CTRL0_CONTROL_MODE_MASK;
    }

    //    b. Set LDOs in LPSR domain controlled by setpoint.
    //     i. Set PLL_LDO controlled by setpoint.
    PMU_GPCEnableLdo(kPMU_PllLdo, PM_RT1170_PLL_LDO_EN_SETPOINT_MAP);
    PMU_GPCEnableLdoStandbyMode(kPMU_PllLdo, PM_RT1170_PLL_LDO_STANDBY_SETPOINT_MAP);
    PMU_SetPllLdoControlMode(ANADIG_PMU, kPMU_GPCMode);

    //     ii. Set LPSR_DIG LDO controlled by setpoint

    PMU_GPCEnableLdo(kPMU_LpsrDigLdo, PM_RT1170_LPSR_DIG_LDO_EN_SETPOINT_MAP);
    PMU_GPCEnableLdoStandbyMode(kPMU_LpsrDigLdo, PM_RT1170_LPSR_DIG_LDO_STANDBY_SETPOINT_MAP);
    PMU_GPCSetLdoOperateMode(kPMU_LpsrDigLdo, PM_RT1170_LPSR_DIG_LDO_LP_MODE_SETPOINT_MAP, kPMU_HighPowerMode);
    PMU_GPCEnableLdoTrackingMode(kPMU_LpsrDigLdo, PM_RT1170_LPSR_DIG_LDO_TRACKING_EN_SETPOINT_MAP);
    PMU_GPCEnableLdoBypassMode(kPMU_LpsrDigLdo, PM_RT1170_LPSR_DIG_LDO_BYPASS_EN_SETPOINT_MAP);
    for (uint8_t i = 0U; i < 16U; i++)
    {
       PMU_GPCSetLpsrDigLdoTargetVoltage(1U << i, g_lpsrDigLdoTargetVoltage[i]);
    }
    PMU_SetLpsrDigLdoControlMode(ANADIG_LDO_SNVS, kPMU_GPCMode);

    //     iii. Set LPSR_ANA LDO controlled by setpoint.
    PMU_GPCEnableLdo(kPMU_LpsrAnaLdo, PM_RT1170_LPSR_ANA_LDO_EN_SETPOINT_MAP);
    PMU_GPCEnableLdoStandbyMode(kPMU_LpsrAnaLdo, PM_RT1170_LPSR_ANA_LDO_STANDBY_SETPOINT_MAP);
    PMU_GPCSetLdoOperateMode(kPMU_LpsrAnaLdo, PM_RT1170_LPSR_ANA_LDO_LP_MODE_SETPOINT_MAP, kPMU_HighPowerMode);
    PMU_GPCEnableLdoTrackingMode(kPMU_LpsrAnaLdo, PM_RT1170_LPSR_ANA_LDO_TRACKING_EN_SETPOINT_MAP);
    PMU_GPCEnableLdoBypassMode(kPMU_LpsrAnaLdo, PM_RT1170_LPSR_ANA_LDO_BYPASS_EN_SETPOINT_MAP);
    PMU_SetLpsrAnaLdoControlMode(ANADIG_LDO_SNVS, kPMU_GPCMode);
}

/*!
 * @brief Set reset slices's control mode, CM7 is responsible for set this.
 */
static inline void RT1170_SetSRCControlMode(void)
{
    SRC_ClearGlobalSystemResetStatus(SRC, 0xFFFFFFFFUL);
    //    a. Reset slice corresponding to MEGA is controlled by setpoint.
    SRC_EnableSetPointTransferReset(SRC, kSRC_MegaSlice, true);
    SRC_SetSliceSetPointConfig(SRC, kSRC_MegaSlice, PM_RT1170_MEGAMIX_SETPOINT_MAP);
    //    b. Reset slice corresponding to DISPLAY is controlled by setpoint.
    SRC_EnableSetPointTransferReset(SRC, kSRC_DisplaySlice, true);
    SRC_SetSliceSetPointConfig(SRC, kSRC_DisplaySlice, PM_RT1170_DISPLAYMIX_SETPOINT_MAP);
    //    c. Reset slice corresponding to WAKEUP is controlled by setpoint.
    SRC_EnableSetPointTransferReset(SRC, kSRC_WakeUpSlice, true);
    SRC_SetSliceSetPointConfig(SRC, kSRC_WakeUpSlice, PM_RT1170_WAKEUPMIX_SETPOINT_MAP);
    //    d. Reset slice corresponding to LPSR is controlled by setpoint.
    SRC_EnableSetPointTransferReset(SRC, kSRC_LpsrSlice, true);
    SRC_SetSliceSetPointConfig(SRC, kSRC_LpsrSlice, PM_RT1170_LPSRMIX_SETPOINT_MAP);
    //    e. Reset slice corresponding to Cortex-M4 platform is controlled by entering of suspend mode.
    SRC_SetAssignList(SRC, kSRC_M4CoreSlice, kSRC_CM4Core);
    SRC_SetSliceDomainModeConfig(SRC, kSRC_M4CoreSlice, kSRC_Cpu1SuspendModeAssertReset);
    SRC_EnableDomainModeTransferReset(SRC, kSRC_M4CoreSlice, true);
    //    f. Reset slice corresponding to Cortex-M7 platform is controlled by entering of suspend mode.
    SRC_SetAssignList(SRC, kSRC_M7CoreSlice, kSRC_CM7Core);
    SRC_SetSliceDomainModeConfig(SRC, kSRC_M7CoreSlice, kSRC_Cpu0SuspendModeAssertReset);
    SRC_EnableDomainModeTransferReset(SRC, kSRC_M7CoreSlice, true);
    //    g. Reset slice corresponding to CM4 Debug is controlled by entering of suspend mode.
    SRC_SetAssignList(SRC, kSRC_M4DebugSlice, kSRC_CM4Core);
    SRC_SetSliceDomainModeConfig(SRC, kSRC_M4DebugSlice, kSRC_Cpu1SuspendModeAssertReset);
    SRC_EnableDomainModeTransferReset(SRC, kSRC_M4DebugSlice, true);
    //    h. Reset slice corresponding to CM7 Debug is controlled by entering of suspend mode.
    SRC_SetAssignList(SRC, kSRC_M7DebugSlice, kSRC_CM7Core);
    SRC_SetSliceDomainModeConfig(SRC, kSRC_M7DebugSlice, kSRC_Cpu0SuspendModeAssertReset);
    SRC_EnableDomainModeTransferReset(SRC, kSRC_M7DebugSlice, true);
    //    i. Reset slice corresponding to USBPHY1 and USBPHY2 is controlled by WAKEUP domain's setpoint request.
    SRC_EnableSetPointTransferReset(SRC, kSRC_Usbphy1Slice, true);
    SRC_SetSliceSetPointConfig(SRC, kSRC_Usbphy1Slice, PM_RT1170_WAKEUPMIX_SETPOINT_MAP);
    SRC_EnableSetPointTransferReset(SRC, kSRC_Usbphy2Slice, true);
    SRC_SetSliceSetPointConfig(SRC, kSRC_Usbphy2Slice, PM_RT1170_WAKEUPMIX_SETPOINT_MAP);
}

/*!
 * @brief Set setpoint transition flow, CM7 is responsible for this.
 */
static inline void RT1170_SetSetpointTransitionFlow(void)
{
    gpc_tran_step_config_t transferStepConfig = {
        .stepCount  = 0UL,
        .cntMode    = kGPC_StepCounterDisableMode,
        .enableStep = false,
    };
    //   a. Disable SSARC Save.
    transferStepConfig.enableStep = false;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_SsarSave, &transferStepConfig);
    //   b. User can determine if LPCG controlled by CPU mode or controlled by setpoint.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_LpcgOff, &transferStepConfig);
    //   c. User can determine if CLOCK GROUP controlled by setpoint.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_GroupDown, &transferStepConfig);
    //   d. User can determine if CLOCK ROOT controlled by setpoint.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_RootDown, &transferStepConfig);
    //   e. Enable PLL off step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_PllOff, &transferStepConfig);
    //   f. Enable ISO.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_IsoOn, &transferStepConfig);
    //   g. Enable Reset early step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_ResetEarly, &transferStepConfig);
    //   h. Enable Power Off step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_PowerOff, &transferStepConfig);
    //   i. Enable Bias off step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_BiasOff, &transferStepConfig);
    //   j. Enable Bandgap and PLL_LDO off step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_BandgapPllLdoOff, &transferStepConfig);
    //   k. Enable LDO pre control step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_LdoPre, &transferStepConfig);
    //   l. Enable DCDC down step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_DcdcDown, &transferStepConfig);
    //   m. Enable DCDC Up step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_DcdcUp, &transferStepConfig);
    //   n. Enable LDO post control step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_LdoPost, &transferStepConfig);
    //   o. Enable Bandgap and PLL_LDO on step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_BandgapPllLdoOn, &transferStepConfig);
    //   p. Enable Bias on step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_BiasOn, &transferStepConfig);
    //   q. Enable Power On step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_PowerOn, &transferStepConfig);
    //   r. Enable Reset late step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_ResetLate, &transferStepConfig);
    //   s. Enable ISO.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_IsoOff, &transferStepConfig);
    //   t. Enable PLL on step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_PllOn, &transferStepConfig);
    //   u. Enable clock root up step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_RootUp, &transferStepConfig);
    //   v. Enable Clock Group up step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_GroupUp, &transferStepConfig);
    //   w. Enable Clock LPCG On step.
    transferStepConfig.enableStep = true;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_LpcgOn, &transferStepConfig);
    //   x. Disable SSARC Restore.
    transferStepConfig.enableStep = false;
    GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL, kGPC_SP_SsarRestore, &transferStepConfig);
}

/*!
 * @brief Set standby transition flow, CM7 is responsible for this.
 */
static inline void RT1170_SetStandbyTransitionFlow(void)
{
    gpc_tran_step_config_t transferStepConfig = {
        .stepCount  = 0UL,
        .cntMode    = kGPC_StepCounterDisableMode,
        .enableStep = false,
    };

    //   a. Enable LPCG is control step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_LpcgIn, &transferStepConfig);
    //   b. Enable PLL control step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_PllIn, &transferStepConfig);
    //   c. Enable Bias In step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_BiasIn, &transferStepConfig);
    //   d. Enable PLDO In step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_PldoIn, &transferStepConfig);
    //   e. Enable Bandgap In step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_BandgapIn, &transferStepConfig);
    //   f. Enable LDO In step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_LdoIn, &transferStepConfig);
    //   g. Enable DCDC In step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_DcdcIn, &transferStepConfig);
    //   h. Disable PMIC In step. TODO: Support PMIC board.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_PmicIn, &transferStepConfig);
    //   i. Disable PMIC Out step. TODO: Support PMIC board.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_PmicOut, &transferStepConfig);
    //   j. Enable DCDC Out step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_DcdcOut, &transferStepConfig);
    //   k. Enable LDO Out step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_LdoOut, &transferStepConfig);
    //   l. Enable Bandgap Out step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_BandgapOut, &transferStepConfig);
    //   m. Enable PLDO Out step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_PldoOut, &transferStepConfig);
    //   n. Enable Bias Out step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_BiasOut, &transferStepConfig);
    //   o. Enable PLL Out step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_PllOut, &transferStepConfig);
    //   p. Enable/disable LPCG is control step.
    transferStepConfig.enableStep = true;
    GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL, kGPC_STBY_LpcgOut, &transferStepConfig);
}
#endif /* __CORTEX_M == 7 */

