nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MIMXRT1172/fsl_pm_device.c
            if (RT1170_FindOperateMode(kResc_STBY_REQ, pSysRescGroup) != PM_RESOURCE_FULL_ON)
            {
                // If not request to de-assert standby request, assert standby request when CPU entering selected CPU
                // mode.
                GPC_CM_RequestStandbyMode(CURRENT_GPC_INSTANCE, nextCpuMode);
            }

            if (nextCpuMode == kGPC_WaitMode)
            {
                // Clear the SLEEPDEEP bit to go into sleep mode (WAIT)
                SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
            }
            else
            {
                // Set the SLEEPDEEP bit to go into deep sleep mode (STOP and SUSPEND)
                SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
            }
            __DSB();
            __ISB();
            __WFI();
        }
    }
}

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
static status_t RT1170_ManageWakeupSource(pm_wakeup_source_t *ws, bool enable)
{
    uint32_t irqId = 0UL;
    irqId          = PM_DECODE_WAKEUP_SOURCE_ID(ws->wsId);
    if (enable)
    {
        // Enabled selected wakeup source, including enable it in NVIC and GPC.
        EnableIRQ((IRQn_Type)irqId);
        GPC_CM_EnableIrqWakeup(CURRENT_GPC_INSTANCE, irqId, true);
    }
    else
    {
        // Disable selected wakeup source, including disable it in NVIC and GPC.
        DisableIRQ((IRQn_Type)irqId);
        GPC_CM_EnableIrqWakeup(CURRENT_GPC_INSTANCE, irqId, false);
    }

    return kStatus_Success;
}

static bool RT1170_IsWakeupSource(pm_wakeup_source_t *ws)
{
    uint32_t irqId = 0UL;
    bool ret       = false;

    irqId = PM_DECODE_WAKEUP_SOURCE_ID(ws->wsId);
    ret   = GPC_CM_GetIrqWakeupStatus(CURRENT_GPC_INSTANCE, irqId);

    return ret;
}
#endif /* (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) */
